// controllers/detailsupportController.js

const exercises = [
  {
    id: 'squat',
    name: 'Squat',
    video: '/videos/squat.mp4',
    targetMuscle: 'ขา & สะโพก',
    exerciseType: 'บอดี้เวท',
    experience: 'ผู้เริ่มต้น',
    description: 'Squats ช่วยเสริมสร้างความแข็งแรงของร่างกายส่วนล่าง โดยเน้นที่ ต้นขา (Quads), สะโพก (Glutes), และเอ็นร้อยหวาย (Hamstrings)',
    steps: [
      'ยืนให้เท้าห่างกันเท่าความกว้างของไหล่',
      'ลดสะโพกลงจนต้นขาขนานกับพื้น',
      'รักษาหลังให้ตรง และยกอกขึ้น',
      'ออกแรงดันผ่านส้นเท้าเพื่อกลับสู่ท่ายืน',
    ]
  },
  {
    id: 'push-up',
    name: 'Push-up',
    video: '/videos/pushup.mp4',
    targetMuscle: 'หน้าอก, แขน, แกนกลางลำตัว',
    exerciseType: 'บอดี้เวท',
    experience: 'ผู้เริ่มต้น',
    description: 'Push-ups ช่วยเสริมสร้างความแข็งแรงให้กับ กล้ามเนื้อหน้าอก (Chest), หัวไหล่ (Shoulders), และแกนกลางลำตัว (Core)',
    steps: [
      'เริ่มในท่า Push-ups โดยให้มืออยู่ระดับหัวไหล่',
      'ลดตัวลงจนหน้าอกเกือบแตะพื้น',
      'อศอกเป็นมุม 45 องศา ขณะลดตัวลงน',
      'ดันตัวกลับขึ้นสู่ท่าเริ่มต้น',
    ]
  },
  {
    id: 'plank',
    name: 'plank',
    video: '/videos/plank.mp4',
    targetMuscle: 'แกนกลางลำตัว, หน้าท้อง, หลังส่วนล่าง, ไหล่ ',
    exerciseType: 'บอดี้เวท',
    experience: 'ผู้เริ่มต้น',
    description: 'Plank เป็นหนึ่งในท่าฝึกกล้ามเนื้อแกนกลางที่มีประสิทธิภาพสูงสุด โดยช่วยเสริมสร้างความแข็งแรงให้กับ หน้าท้อง, หลังส่วนล่าง, ไหล่, และสะโพก พร้อมทั้งช่วยปรับปรุงท่าทางและความสมดุลของร่างกาย',
    steps: [
      'เริ่มต้นในท่า Plank โดยนอนคว่ำลงกับพื้น วางปลายเท้าติดพื้น และใช้ ปลายแขน หรือ ฝ่ามือ รองรับน้ำหนัก ',
      'จัดระเบียบร่างกายให้ถูกต้อง ศอกอยู่ตรงใต้หัวไหล่ลำตัวตรงจากศีรษะถึงส้นเท้า เกร็งหน้าท้องและสะโพก เพื่อป้องกันหลังแอ่นหรือก้นโด่ง ',
      'ค้างท่านี้ไว้ อย่างน้อย 20-60 วินาที หรือให้นานที่สุดเท่าที่ทำได้หายใจเข้าออกสม่ำเสมอ',
      'ลดตัวลงนั่งหรือคุกเข่าพัก ทำซ้ำ 3-5 เซ็ต ตามระดับความสามารถ',
    ]
  },
  {
  id: 'jumping-jack',
    name: 'JumpingJack',
    video: '/videos/jumpingJack.mp4',
    targetMuscle: 'ขา, สะโพก, หัวไหล่, หัวใจและปอด',
    exerciseType: 'บอดี้เวท',
    experience: 'ผู้เริ่มต้น',
    description: 'Jumping Jacks เป็นท่าออกกำลังกายแบบ คาร์ดิโอ (Cardio) ที่ช่วยเพิ่มอัตราการเต้นของหัวใจ เผาผลาญแคลอรี และฝึกความทนทานของกล้ามเนื้อ ขา, สะโพก และหัวไหล่',
    steps: [
      'เตรียมพร้อมยืนตรง เท้าชิดกัน และวางมือไว้ข้างลำตัว',
      'กระโดดขึ้นเล็กน้อย ขณะเดียวกันให้แยกขาออก และยกแขนขึ้นเหนือศีรษะจนมือเกือบชนกัน',
      'กระโดดกลับมาสู่ท่ายืน เท้าชิดกัน แล้วลดแขนกลับมาข้างลำตัว',
      'ทำซ้ำเป็นเวลา 30-60 วินาที หรือ 15-30 ครั้ง ต่อเซ็ต ทำ 3-5 เซ็ต ตามระดับความสามารถ',
    ]
  },
  {
    id: 'bridge',
      name: 'Bridge',
      video: '/videos/bridge.mp4',
      targetMuscle: ' สะโพก, หลังส่วนล่าง, ต้นขาหลัง, แกนกลางลำตัว',
      exerciseType: 'บอดี้เวท',
      experience: 'ผู้เริ่มต้น',
      description: 'Bridge เป็นท่าออกกำลังกายที่ช่วยเสริมสร้างความแข็งแรงของกล้ามเนื้อ สะโพก, หลังส่วนล่าง, และต้นขาหลัง ช่วยปรับปรุงท่าทาง ลดอาการปวดหลัง และเพิ่มความมั่นคงของแกนกลางลำตัว',
      steps: [
        'เตรียมพร้อม นอนหงายลงบนพื้น ชันเข่าขึ้น ให้เท้าห่างกันประมาณสะโพก แล้ววางมือไว้ข้างลำตัว ฝ่ามือคว่ำลง',
        'ออกแรงจากส้นเท้า ดันสะโพกขึ้น จนลำตัวเป็นเส้นตรงจากไหล่ถึงเข่าเกร็งสะโพก และหน้าท้อง',
        'คงท่านี้ไว้ 2-3 วินาทีควบคุมการหายใจให้เป็นจังหวะ',
        'ค่อยๆ ลดสะโพกลงสู่พื้นช้าๆทำซ้ำ 10-15 ครั้ง ต่อเซ็ต ทำ 3-5 เซ็ต ตามระดับความสามารถ',
      ]
    },
];

exports.getDetailSupport = (req, res) => {
  // ดึง id จาก URL (req.params.id)
  const exercise = exercises.find(ex => ex.id === req.params.id);
  if (!exercise) {
    return res.status(404).send('Exercise not found');
  }
  // render หน้า detailsupport.ejs พร้อมส่ง exercise ไป
  res.render('detailsupport', { exercise });
};
